import os
from dotenv import load_dotenv

load_dotenv()

BOT_TOKEN=os.getenv("BOT_TOKEN")
#target group id
GROUP_ID = int(os.getenv("GROUP_ID"))
ADMINS = os.getenv("ADMINS").split(",")
ADMINS = [int(adm) for adm in ADMINS]


MOIZVONKI_API = os.getenv("MOIZVONKI_API")
MOIZVONKI_USERNAME = os.getenv("MOIZVONKI_USERNAME")

MOIZVONKI_MANAGER_MAP = {
    21: "Хадича Халматова",
    20: "Гузал Кенжайева",
    12: "Нодирабегим Собиржонова",
    18: "Эзоза Салохиддинова",
    17: "Озода Бойсариева",
    5: "Нодира Ботабоева",
    7: "Феруза Нурлибаева",
    2: "Комила Ботирова",
    11: "Машхура Неьматжонова",
    10: "Юлдуз Калдыбаева",
    6: "Эзозахон Каримова",
    8: "Шоира Бердирасулова",
    14: "Мухтарам Расулова",
    13: "Дильноза Бекчанова",
    9: "Азиза Рустамова"
}

MOIZVONKI_DIRECTION = {
    0: "входящий",
    1: "исходящий"
}

MOIZVONKI_ANSWERED = {
    0: "нет",
    1: "да"
}



##--------------------------------Clockster-------------------------------------------
CLOCKSTER_TOKEN = os.getenv("CLOCKSTER_TOKEN")

CLOCKSTER_USERS = {
    "Азиза Рустамова": 228003,
    "Гузал Кенжайева": 409742,
    "Дильноза Бекчанова": 136784,
    "Комила Ботирова": 136789,
    "Машхура Неьматжонова": 136790,
    "Мухтарам Расулова": 227970,
    "Нодира Ботабоева": 136786,
    "Нодирабегим Собиржонова": 209729,
    "Озода Бойсариева": 384305,
    "Феруза Нурлибаева": 208755,
    "Хадича Халматова": 409740,
    "Шоира Бердирасулова": 140444,
    "Эзоза Салохиддинова": 409134,
    "Эзозахон Каримова": 136787,
    "Юлдуз Калдыбаева": 208548
}